In [2]:
import os
import pandas as pd

### To change working directory

In [2]:
os.chdir("E:/nptel")

### Comma separated values

### Importing data

In [3]:
data_csv = pd.read_csv('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.csv')

In [4]:
data_csv

   Unnamed: 0 SepalLength  SepalWidth PetalLength  PetalWidth      Species
0           1         5.1         3.5         1.4         0.2  Iris-setosa
1           2         4.9         NaN         1.4         0.2          NaN
2           3         4.7         3.2         1.3         0.2  Iris-setosa
3           4          ??         3.1         1.5         0.2  Iris-setosa
4           5           5         3.6         ###         0.2  Iris-setosa

### Removing extra id column by passing index_col = 0

In [5]:
data_csv = pd.read_csv('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.csv', index_col = 0)

In [6]:
data_csv

  SepalLength  SepalWidth PetalLength  PetalWidth      Species
1         5.1         3.5         1.4         0.2  Iris-setosa
2         4.9         NaN         1.4         0.2          NaN
3         4.7         3.2         1.3         0.2  Iris-setosa
4          ??         3.1         1.5         0.2  Iris-setosa
5           5         3.6         ###         0.2  Iris-setosa

### Replacing ‘??’ and ‘# # #’ as missing values

Junk values can be converted to missing values by passing them as a list to the parameter 'na_values'

In [7]:
data_csv = pd.read_csv('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.csv', index_col = 0, na_values=["??"])

In [8]:
data_csv = pd.read_csv('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.csv', index_col = 0, na_values=["??", "###"])

In [9]:
data_csv

   SepalLength  SepalWidth  PetalLength  PetalWidth      Species
1          5.1         3.5          1.4         0.2  Iris-setosa
2          4.9         NaN          1.4         0.2          NaN
3          4.7         3.2          1.3         0.2  Iris-setosa
4          NaN         3.1          1.5         0.2  Iris-setosa
5          5.0         3.6          NaN         0.2  Iris-setosa

### Excel spreadsheets

### Importing data

In [10]:
data_xlsx = pd.read_excel('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.xlsx', sheet_name = 'Iris_data'),

In [11]:
data_xlsx

(   Unnamed: 0 SepalLength  SepalWidth PetalLength  PetalWidth      Species
 0           1         5.1         3.5         1.4         0.2  Iris-setosa
 1           2         4.9         NaN         1.4         0.2          NaN
 2           3         4.7         3.2         1.3         0.2  Iris-setosa
 3           4          ??         3.1         1.5         0.2  Iris-setosa
 4           5           5         3.6         ###         0.2  Iris-setosa,)

In [12]:
data_xlsx = pd.read_excel('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.xlsx', index_col = 0, na_values=["??", "###"])

In [13]:
data_xlsx

   SepalLength  SepalWidth  PetalLength  PetalWidth      Species
1          5.1         3.5          1.4         0.2  Iris-setosa
2          4.9         NaN          1.4         0.2          NaN
3          4.7         3.2          1.3         0.2  Iris-setosa
4          NaN         3.1          1.5         0.2  Iris-setosa
5          5.0         3.6          NaN         0.2  Iris-setosa

### Text format

### Importing data

In [3]:
data_txt1= pd.read_table('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.txt')

In [4]:
data_txt1

     "SepalLengthCm" "SepalWidthCm" "PetalLengthCm" "PetalWidthCm" "Species"
0                    1 1 5.1 3.5 1.4 0.2 "Iris-setosa"
1                      2 2 4.9 3 1.4 0.2 "Iris-setosa"
2                    3 3 4.7 3.2 1.3 0.2 "Iris-setosa"
3                    4 4 4.6 3.1 1.5 0.2 "Iris-setosa"
4                      5 5 5 3.6 1.4 0.2 "Iris-setosa"
..                                                 ...
145             146 146 6.7 3 5.2 2.3 "Iris-virginica"
146             147 147 6.3 2.5 5 1.9 "Iris-virginica"
147               148 148 6.5 3 5.2 2 "Iris-virginica"
148           149 149 6.2 3.4 5.4 2.3 "Iris-virginica"
149             150 150 5.9 3 5.1 1.8 "Iris-virginica"

[150 rows x 1 columns]

All columns read and stored in a single column of dataframe

In order to avoid this, provide a delimiter to the parameters
'sep' or 'delimiter'

Default delimiter is tab represented by '\t'

In [5]:
data_txt1= pd.read_table('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.txt', sep = '\t')

In [6]:
data_txt1

     "SepalLengthCm" "SepalWidthCm" "PetalLengthCm" "PetalWidthCm" "Species"
0                    1 1 5.1 3.5 1.4 0.2 "Iris-setosa"
1                      2 2 4.9 3 1.4 0.2 "Iris-setosa"
2                    3 3 4.7 3.2 1.3 0.2 "Iris-setosa"
3                    4 4 4.6 3.1 1.5 0.2 "Iris-setosa"
4                      5 5 5 3.6 1.4 0.2 "Iris-setosa"
..                                                 ...
145             146 146 6.7 3 5.2 2.3 "Iris-virginica"
146             147 147 6.3 2.5 5 1.9 "Iris-virginica"
147               148 148 6.5 3 5.2 2 "Iris-virginica"
148           149 149 6.2 3.4 5.4 2.3 "Iris-virginica"
149             150 150 5.9 3 5.1 1.8 "Iris-virginica"

[150 rows x 1 columns]

In [7]:
data_txt1= pd.read_table('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.txt', delimiter = ' ')

In [8]:
data_txt1

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
1,1,5.1,3.5,1.4,0.2,Iris-setosa
2,2,4.9,3.0,1.4,0.2,Iris-setosa
3,3,4.7,3.2,1.3,0.2,Iris-setosa
4,4,4.6,3.1,1.5,0.2,Iris-setosa
5,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
146,146,6.7,3.0,5.2,2.3,Iris-virginica
147,147,6.3,2.5,5.0,1.9,Iris-virginica
148,148,6.5,3.0,5.2,2.0,Iris-virginica
149,149,6.2,3.4,5.4,2.3,Iris-virginica
150,150,5.9,3.0,5.1,1.8,Iris-virginica

Other commonly used delimiters are commas and blanks

In this case using a comma as a delimiter also gives the
earlier output

In [9]:
data_txt1= pd.read_table('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.txt', delimiter = " ")

In [10]:
data_txt1

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
1,1,5.1,3.5,1.4,0.2,Iris-setosa
2,2,4.9,3.0,1.4,0.2,Iris-setosa
3,3,4.7,3.2,1.3,0.2,Iris-setosa
4,4,4.6,3.1,1.5,0.2,Iris-setosa
5,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
146,146,6.7,3.0,5.2,2.3,Iris-virginica
147,147,6.3,2.5,5.0,1.9,Iris-virginica
148,148,6.5,3.0,5.2,2.0,Iris-virginica
149,149,6.2,3.4,5.4,2.3,Iris-virginica
150,150,5.9,3.0,5.1,1.8,Iris-virginica

#### Remove index column and replace ‘??’ and ‘# # #’ as missing values
#### Instead of using read_table (), read_csv()  can also be used to read .txt files

In [11]:
data_txt1= pd.read_csv('E:/nptel/Python for Data Science/week3/Week3_Slides-20230804T170748Z-001/Iris_Data_Sample.txt', delimiter = " ")

In [12]:
data_txt1

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
1,1,5.1,3.5,1.4,0.2,Iris-setosa
2,2,4.9,3.0,1.4,0.2,Iris-setosa
3,3,4.7,3.2,1.3,0.2,Iris-setosa
4,4,4.6,3.1,1.5,0.2,Iris-setosa
5,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
146,146,6.7,3.0,5.2,2.3,Iris-virginica
147,147,6.3,2.5,5.0,1.9,Iris-virginica
148,148,6.5,3.0,5.2,2.0,Iris-virginica
149,149,6.2,3.4,5.4,2.3,Iris-virginica
150,150,5.9,3.0,5.1,1.8,Iris-virginica

#### Importing Data

In [2]:
import pandas as pd

In [3]:
cars_data = pd.read_csv('Toyota.csv')

In [4]:
cars_data

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...,...
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

#### Two ways to create copy:
    Shallow copy
    Deep copy

#### Shallow copy:
    
    * It only creates a new variable that shares the reference of the original object

    * Any changes made to a copy of object will be reflected in the original object as well

#### Deep copy:
    
     * In case of deep copy, a copy of object is copied in other object with no reference to the original

    * Any changes made to a copy of object will not be reflected in the original object

In [5]:
cars_data1 = cars_data.copy(deep=True)   # deep = False for Shallow copy

In [6]:
cars_data1.index

RangeIndex(start=0, stop=1436, step=1)

#### To get column labels of the dataframe

In [7]:
cars_data1.columns

Index(['Unnamed: 0', 'Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor',
       'Automatic', 'CC', 'Doors', 'Weight'],
      dtype='object')

#### To get the total number of elements from the dataframe

In [8]:
cars_data1.size

15796

#### To get dimensionality of the dataframe

In [9]:
cars_data1.shape   # 1436 rows, 11 columns

(1436, 11)

#### To get memory usage of each column in bytes

In [20]:
cars_data1.memory_usage()

Index           128
Unnamed: 0    11488
Price         11488
Age           11488
KM            11488
FuelType      11488
HP            11488
MetColor      11488
Automatic     11488
CC            11488
Doors         11488
Weight        11488
dtype: int64

#### The number of axes/array dimension

In [21]:
cars_data1.ndim

2

#### Indexing and selecting data

    * Python slicing operator and attribute/dot operator are used for indexing
    * Provides quick and easy access to pandas data structures

In [22]:
cars_data1.head(6)    #to display first 5 rows

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
5,5,12950,32.0,61000,Diesel,90,0.0,0,2000,3,1170

In [23]:
cars_data1.tail()   #to display last 5 rows

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

#### To access a scalar value, the fastest way is to use the at and iat methods

#### at provides label based scalar lookups

In [10]:
cars_data1.at[4, 'FuelType']

'Diesel'

In [11]:
cars_data1.at[1434, 'FuelType']

nan

#### iat provides integer based lookups

In [12]:
cars_data1.iat[5,6]

0.0

In [13]:
cars_data1.iat[1,0]

1

In [14]:
cars_data1.iat[5,9]

'3'

#### To access a group of rows and columns by label(s) loc[] can be used

In [29]:
cars_data1.loc[:,'FuelType']

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object

In [30]:
cars_data1.loc[:,['FuelType', 'Weight','CC']]

     FuelType  Weight    CC
0      Diesel    1165  2000
1      Diesel    1165  2000
2      Diesel    1165  2000
3      Diesel    1165  2000
4      Diesel    1170  2000
...       ...     ...   ...
1431   Petrol    1025  1300
1432   Petrol    1015  1300
1433   Petrol    1015  1300
1434      NaN    1015  1300
1435   Petrol    1114  1600

[1436 rows x 3 columns]

In [31]:
cars_data1.loc[1:5,['FuelType', 'Weight','CC']]

  FuelType  Weight    CC
1   Diesel    1165  2000
2   Diesel    1165  2000
3   Diesel    1165  2000
4   Diesel    1170  2000
5   Diesel    1170  2000

#### Checking data types of each column

#### dtypes returns a series with the data type of each column

   #### Syntax:
   ####  DataFrame.dtypes

In [15]:
cars_data1.dtypes

Unnamed: 0      int64
Price           int64
Age           float64
KM             object
FuelType       object
HP             object
MetColor      float64
Automatic       int64
CC              int64
Doors          object
Weight          int64
dtype: object

### Count of unique data types

#### get_dtype_counts returns counts of unique data types in the dataframe

#### Syntax:
    
#### DataFrame.get_dtype_counts

In [16]:
cars_data1.get_dtype_counts()

AttributeError: 'DataFrame' object has no attribute 'get_dtype_counts'

#### Use .dtypes.value_counts() instead.

In [36]:
cars_data1.dtypes.value_counts()

int64      5
object     4
float64    2
dtype: int64

#### Examples

In [28]:
a = [['a', 1, 1.0], ['b', 2, 2.0], ['c', 3, 3.0]]
df = pd.DataFrame(a, columns=['str', 'int', 'float'])
df

  str  int  float
0   a    1    1.0
1   b    2    2.0
2   c    3    3.0

### Selecting data based on data types

#### pandas.DataFrame.select_dtypes() returns a subset of the columns from dataframe based on the column dtypes

#### Syntax:

#### DataFrame.select_dtypes (include=None, exclude=None)

In [37]:
cars_data1.select_dtypes(include=None, exclude=object)

      Unnamed: 0  Price   Age  MetColor  Automatic    CC  Weight
0              0  13500  23.0       1.0          0  2000    1165
1              1  13750  23.0       1.0          0  2000    1165
2              2  13950  24.0       NaN          0  2000    1165
3              3  14950  26.0       0.0          0  2000    1165
4              4  13750  30.0       0.0          0  2000    1170
...          ...    ...   ...       ...        ...   ...     ...
1431        1431   7500   NaN       1.0          0  1300    1025
1432        1432  10845  72.0       0.0          0  1300    1015
1433        1433   8500   NaN       0.0          0  1300    1015
1434        1434   7250  70.0       1.0          0  1300    1015
1435        1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 7 columns]

In [38]:
cars_data1.select_dtypes(exclude=[object])

      Unnamed: 0  Price   Age  MetColor  Automatic    CC  Weight
0              0  13500  23.0       1.0          0  2000    1165
1              1  13750  23.0       1.0          0  2000    1165
2              2  13950  24.0       NaN          0  2000    1165
3              3  14950  26.0       0.0          0  2000    1165
4              4  13750  30.0       0.0          0  2000    1170
...          ...    ...   ...       ...        ...   ...     ...
1431        1431   7500   NaN       1.0          0  1300    1025
1432        1432  10845  72.0       0.0          0  1300    1015
1433        1433   8500   NaN       0.0          0  1300    1015
1434        1434   7250  70.0       1.0          0  1300    1015
1435        1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 7 columns]

In [39]:
cars_data1.select_dtypes(include=object, exclude=None)

         KM FuelType   HP  Doors
0     46986   Diesel   90  three
1     72937   Diesel   90      3
2     41711   Diesel   90      3
3     48000   Diesel   90      3
4     38500   Diesel   90      3
...     ...      ...  ...    ...
1431  20544   Petrol   86      3
1432     ??   Petrol   86      3
1433  17016   Petrol   86      3
1434     ??      NaN   86      3
1435      1   Petrol  110      5

[1436 rows x 4 columns]

### info() returns a concise summary of a dataframe

#### data type of index

#### data type of columns

#### count of non null values

#### memory usage

### Syntax:
    
#### DataFrame.info()

In [40]:
cars_data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 123.5+ KB

### Unique elements of columns

#### unique() is used to find the unique elements of a column

#### Syntax:
### numpy.unique(array)

In [17]:
import numpy as np

In [18]:
np.unique(cars_data1['KM'])

array(['1', '10000', '100123', ..., '99865', '99971', '??'], dtype=object)

In [22]:
np.unique(cars_data['FuelType'])

TypeError: '<' not supported between instances of 'float' and 'str'

In [21]:
np.unique(cars_data['Automatic'])

array([0, 1], dtype=int64)

Importing data

We need to know how missing values are represented in the dataset in order to make reasonable decisions

The missing values exist in the form of 'nan' '??' '????'

Python, by default replace blank values with 'nan'

Now, importing the data considering other forms of missing values in a dataframe

In [47]:
cars_data = pd.read_csv('Toyota.csv', index_col=0, na_values=["??", "????"] )

In [48]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

#### Converting variable’s data types astype method is used to explicitly convert data types from one to another

#### Syntax:
#### DataFrame.astype dtype
Converting MetColor ’ , ‘Automatic’ to object data type:

In [49]:
cars_data['MetColor'] = cars_data['MetColor'].astype('object')

In [50]:
cars_data['Automatic'] = cars_data['Automatic'].astype('object')

In [51]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

#### category vs object data type

#### nbytes is used to get the total bytes consumed by the elements of the columns

#### Syntax:
#### ndarray.nbytes

In [52]:
# If FuelType ’ is of object data type,

cars_data['FuelType'].nbytes

11488

In [53]:
# If FuelType ’ is of category data type,

cars_data['FuelType'].astype('category').nbytes

1460

### Rechecking the data type of variables
#### Rechecking the data type of variables after all the conversions

In [54]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

### Cleaning column ‘Doors’

#### Checking unique values of variable ‘Doors’

In [55]:
print(np.unique(cars_data['Doors']))

['2' '3' '4' '5' 'five' 'four' 'three']

#### replace() is used to replace a value with the desired value

#### Syntax: DataFrame.replace([to_replace ,value, …])

In [56]:
cars_data['Doors'].replace('three', 3, inplace = True)
cars_data['Doors'].replace('four', 4, inplace = True)
cars_data['Doors'].replace('five', 5, inplace = True)

In [57]:
print(np.unique(cars_data['Doors']))

TypeError: '<' not supported between instances of 'str' and 'int'

#### Converting ‘Doors’ to int64

In [48]:
cars_data['Doors'] = cars_data['Doors'].astype('int64')

ValueError: invalid literal for int() with base 10: "'three'"

### To detect missing values
#### To check the count of missing values present in each column Dataframe.isnull.sum () is used

In [58]:
cars_data.isnull()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
1431,False,True,False,False,False,False,False,False,False,False
1432,False,False,True,False,False,False,False,False,False,False
1433,False,True,False,False,False,False,False,False,False,False
1434,False,False,True,True,False,False,False,False,False,False
1435,False,False,False,False,False,False,False,False,False,False

In [59]:
cars_data.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64